In [2]:
import numpy as np
import pandas as pd

In [10]:
series=pd.Series([10,20,30,40]) #인덱스 없이 0,1,2,3 으로 접근
series2=pd.Series(range(10,41,10),index=["one","two","three",'four'])
print(series)
print(series2)
# dict 를 이용해서 key 가 index, value= value 가 되도록 설정
series3=pd.Series({"태연":"소녀시대","수지":"MissA","카리나":"aespa"})
print(series3)

0    10
1    20
2    30
3    40
dtype: int64
one      10
two      20
three    30
four     40
dtype: int64
태연      소녀시대
수지     MissA
카리나    aespa
dtype: object

In [11]:
print(series3[0])
print(series3["태연"])
print(series3[0:2])# 일련번호는 종료 번호 전까지 가져옴
print(series3["태연":"카리나"])

소녀시대
소녀시대
태연     소녀시대
수지    MissA
dtype: object
태연      소녀시대
수지     MissA
카리나    aespa
dtype: object

In [13]:
print(series.values) # 값들만 추출
print(series+100) # 연산은 ndarray 와 동일하게 수행되는데 values 속성의 멤버를 가지고 연산

[10 20 30 40]
0    110
1    120
2    130
3    140
dtype: int64

In [14]:
print(np.sum(series))

100

In [18]:
s1=pd.Series({"태연":81,"수지":99,"카리나":100,"지민":88})
s2=pd.Series({"태연":np.nan,"카리나":77,"수지":98,"민지":10})
print(s1+s2) # 없는값이 더해지면 nan 이 나옴

민지       NaN
수지     197.0
지민       NaN
카리나    177.0
태연       NaN
dtype: float64

In [35]:
items={
    'code':[1,2,3,4],
    'name':['수박','키위','사과','망고'],
    'price':[30000,2500,3000,10000]
}
df=pd.DataFrame(items)
df

   code name  price
0     1   수박  30000
1     2   키위   2500
2     3   사과   3000
3     4   망고  10000

In [37]:
df.index=range(1,5)
df.columns=['코드','이름','가격']
df

   코드  이름     가격
1   1  수박  30000
2   2  키위   2500
3   3  사과   3000
4   4  망고  10000

In [38]:
df.head()

   코드  이름     가격
1   1  수박  30000
2   2  키위   2500
3   3  사과   3000
4   4  망고  10000

In [39]:
# 데이터를 머신러닝 하고자 할때 numpy 의 ndarray 로만 가능
print(type(df.values))

<class 'numpy.ndarray'>

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   코드      4 non-null      int64
 1   이름      4 non-null      object
 2   가격      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

## 데이터 가져와서 확인

In [3]:
item=pd.read_csv('./data/item.csv')
item

   code  manufacture            name  price
0     1        korea           apple   1500
1     2        korea      watermelon  15000
2     3        korea  oriental melon   1000
3     4  philippines          banana    500
4     5        korea           lemon   1500
5     6        korea           mango    700

In [4]:
items=pd.read_csv('./data/item.csv',index_col='code')
items

      manufacture            name  price
code
1           korea           apple   1500
2           korea      watermelon  15000
3           korea  oriental melon   1000
4     philippines          banana    500
5           korea           lemon   1500
6           korea           mango    700

In [7]:
goods=pd.read_csv('./data/good.csv',header=None,names=["제품","개수","price"])
# 첫번째 행도 일반 데이터 이므로 첫번째 행이 헤더가 아니라고 설정하고 names 를 이용해 헤더 이름 설정 
goods

       제품  개수  price
0   apple  10   1500
1  banana   5  15000
2   melon   7   1000
3    kiwi  20    500
4   mango  30   1500
5  orange   4    700

In [11]:
# 3개씩 읽어옴
goods=pd.read_csv('./data/good.csv',header=None,names=["제품","개수","price"],chunksize=3)
print(goods)
goods
for piece in goods:
    print(piece)
    print(type(piece))#타입은 dataframe

<pandas.io.parsers.readers.TextFileReader object at 0x12f12fdd0>
       제품  개수  price
0   apple  10   1500
1  banana   5  15000
2   melon   7   1000
<class 'pandas.core.frame.DataFrame'>
       제품  개수  price
3    kiwi  20    500
4   mango  30   1500
5  orange   4    700
<class 'pandas.core.frame.DataFrame'>

In [14]:
goods=pd.read_csv('./data/gapminder.tsv',sep='\t')
goods

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]